#include "Player.h"

//--------------------------------------------------------------------
// 플레이어 인스턴스 선언, (1인용 이니 하나만 하자)
//--------------------------------------------------------------------
PLAYER gPlayer;

void Player_Initial(void)
{
	//-------------------------------------------------------------------
	// 플레이어 최초 데이터 초기화.
	// HP : 3 
	// 39,19 위치에서 시작 함.
	//-------------------------------------------------------------------
	gPlayer._HP = 3;
	gPlayer._Visible = true;

	gPlayer._X = 39;
	gPlayer._Y = 19;
}

void Player_Update(void)
{

}