#include "Player.h"

//--------------------------------------------------------------------
// 아군 구조체 선언
//--------------------------------------------------------------------
struct PLAYER
{
	int _HP;					// 플레이어 HP

	int _X;						// 플레이어 좌표
	int _Y;

	int _Visible;				// 플레이어 생존 여부.
};

//--------------------------------------------------------------------
// 플레이어 인스턴스 선언, (1인용 이니 하나만 하자)
//--------------------------------------------------------------------
PLAYER gPlayer;

void Player_Initial(void)
{
	//-------------------------------------------------------------------
	// 플레이어 최초 데이터 초기화.
	// HP : 3 
	// 39,19 위치에서 시작 함.
	//-------------------------------------------------------------------
	gPlayer._HP = 3;
	gPlayer._Visible = true;

	gPlayer._X = 39;
	gPlayer._Y = 19;
}

void Player_Update(void)
{

}